<script setup lang="ts">
const news = [
  {
    id: '1',
    title: 'Мелочь, а приятно: помыслы поколения чисты',
    description:
      'Вот вам яркий пример современных тенденций - высокотехнологичная концепция общественного уклада требует анализа переосмысления внешнеэкономических политик. Но дальнейшее развитие различных форм деятельности является качественно новой ступенью позиций, занимаемых участниками в отношении поставленных задач. Лишь активно развивающиеся страны третьего мира и по сей день остаются уделом либералов, которые жаждут быть объявлены нарушающими общечеловеческие нормы этики и морали.',
  },
  {
    id: '2',
    title: 'Добрая половина выводов станет частью наших традиций',
    description:
      'Также как глубокий уровень погружения прекрасно подходит для реализации системы массового участия. А ещё стремящиеся вытеснить традиционное производство, нанотехнологии преданы социально-демократической анафеме. Независимые государства освещают чрезвычайно интересные особенности картины в целом, однако конкретные выводы, разумеется, указаны как претенденты на роль ключевых факторов.',
  },
  {
    id: '3',
    title: 'Сложившаяся структура организации расставила все точки над i',
    description:
      'Кстати, действия представителей оппозиции неоднозначны и будут заблокированы в рамках своих собственных рациональных ограничений. В частности, понимание сути ресурсосберегающих технологий, а также свежий взгляд на привычные вещи - безусловно открывает новые горизонты для существующих финансовых и административных условий. Ясность нашей позиции очевидна: сложившаяся структура организации создаёт предпосылки для переосмысления внешнеэкономических политик.',
  },
  {
    id: '4',
    title: 'Базовый вектор развития не позволил союзу развалиться',
    description:
      'Господа, начало повседневной работы по формированию позиции выявляет срочную потребность дальнейших направлений развития. Принимая во внимание показатели успешности, высококачественный прототип будущего проекта создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса благоприятных перспектив. Для современного мира сложившаяся структура организации не оставляет шанса для инновационных методов управления процессами!',
  },
  {
    id: '5',
    title: 'Выбранный нами инновационный путь оправдал надежды граждан',
    description:
      'Предварительные выводы неутешительны: сложившаяся структура организации представляет собой интересный эксперимент проверки поэтапного и последовательного развития общества. С учётом сложившейся международной обстановки, экономическая повестка сегодняшнего дня требует от нас анализа новых принципов формирования материально-технической и кадровой базы. Идейные соображения высшего порядка, а также высокотехнологичная концепция общественного уклада способствует повышению качества переосмысления внешнеэкономических политик.',
  },
  {
    id: '6',
    title: 'И по сей день в центральных регионах звучит перекатами шопот',
    description:
      'Вот вам яркий пример современных тенденций - высокотехнологичная концепция общественного уклада не оставляет шанса для глубокомысленных рассуждений. А ещё диаграммы связей указаны как претенденты на роль ключевых факторов. Каждый из нас понимает очевидную вещь: глубокий уровень погружения обеспечивает актуальность своевременного выполнения сверхзадачи.',
  },
]
</script>

<template>
  <div class="flex flex-wrap -mx-4">
    <news-list-item
      v-for="newsEntry in news"
      :key="newsEntry.id"
      :news-id="newsEntry.id"
      :title="newsEntry.title"
      :description="newsEntry.description"
    />
  </div>
</template>

<route lang="yaml">
meta:
  layout: default
</route>
