<script setup lang="ts">
const route = useRoute()

const title = 'Выбранный нами инновационный путь оправдал надежды граждан'
const description =
  'Предварительные выводы неутешительны: сложившаяся структура организации представляет собой интересный эксперимент проверки поэтапного и последовательного развития общества. С учётом сложившейся международной обстановки, экономическая повестка сегодняшнего дня требует от нас анализа новых принципов формирования материально-технической и кадровой базы. Идейные соображения высшего порядка, а также высокотехнологичная концепция общественного уклада способствует повышению качества переосмысления внешнеэкономических политик.'
</script>

<template>
  <div class="w-full grid grid-cols-1 px-8 xl:grid-cols-2 xl:px-0">
    <u-heading variant="h2" :title="title" />
    <p class="py-0 xl:py-4 leading-relaxed">{{ description }}</p>
  </div>
</template>

<route lang="yaml">
name: newsItem
meta:
  heading: Просмотр новости
  layout: default
</route>
