<script setup lang="ts">
const route = useRoute()

const model = reactive({
  title: 'Выбранный нами инновационный путь оправдал надежды граждан',
  description:
    'Предварительные выводы неутешительны: сложившаяся структура организации представляет собой интересный эксперимент проверки поэтапного и последовательного развития общества. С учётом сложившейся международной обстановки, экономическая повестка сегодняшнего дня требует от нас анализа новых принципов формирования материально-технической и кадровой базы. Идейные соображения высшего порядка, а также высокотехнологичная концепция общественного уклада способствует повышению качества переосмысления внешнеэкономических политик.',
})
</script>

<template>
  <div class="px-8 xl:px-0">
    <u-input v-model="model.title" label="Заголовок" />
    <u-textarea v-model="model.description" rows="8" label="Контент" />
  </div>
</template>

<route lang="yaml">
name: newsItemEdit
meta:
  heading: Редактирование новости
  layout: default
</route>
